In [1]:
                                                  # 06-10-25

In [3]:
import pandas as pd

In [7]:
data = {'col1':[1,2,3,4,5],'col2':['a','b','c','d','e']}
df = pd.DataFrame(data)

In [8]:
print(df)

   col1 col2
0     1    a
1     2    b
2     3    c
3     4    d
4     5    e

In [9]:
df

   col1 col2
0     1    a
1     2    b
2     3    c
3     4    d
4     5    e

In [4]:
data = pd.read_csv(r"C:\Users\HP\Downloads\annual-enterprise-survey-2024-financial-year-provisional.csv")

# The prefix r before a string makes it a raw string in Python.

# It tells Python:
  # “Don’t process backslashes (\) as special escape characters — just keep them as they are.”

In [5]:
data

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2024,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,979594,ANZSIC06 divisions A-S (excluding classes K633...
1,2024,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,838626,ANZSIC06 divisions A-S (excluding classes K633...
2,2024,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,112188,ANZSIC06 divisions A-S (excluding classes K633...
3,2024,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,28781,ANZSIC06 divisions A-S (excluding classes K633...
4,2024,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,856960,ANZSIC06 divisions A-S (excluding classes K633...
...,...,...,...,...,...,...,...,...,...,...
55615,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H37,Quick ratio,Financial ratios,52,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
55616,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H38,Margin on sales of goods for resale,Financial ratios,40,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
55617,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H39,Return on equity,Financial ratios,12,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
55618,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H40,Return on total assets,Financial ratios,5,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
55619,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H41,Liabilities structure,Financial ratios,46,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."

In [6]:
data.head()  # shows the top 4 rows of csv

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2024,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,979594,ANZSIC06 divisions A-S (excluding classes K633...
1,2024,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,838626,ANZSIC06 divisions A-S (excluding classes K633...
2,2024,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,112188,ANZSIC06 divisions A-S (excluding classes K633...
3,2024,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,28781,ANZSIC06 divisions A-S (excluding classes K633...
4,2024,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,856960,ANZSIC06 divisions A-S (excluding classes K633...

In [8]:
data.tail()     # shows the bottom 4 rows of csv

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
55615,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H37,Quick ratio,Financial ratios,52,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
55616,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H38,Margin on sales of goods for resale,Financial ratios,40,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
55617,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H39,Return on equity,Financial ratios,12,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
55618,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H40,Return on total assets,Financial ratios,5,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
55619,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H41,Liabilities structure,Financial ratios,46,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."

In [3]:
                                                  # 07-10-25

In [ ]:
# 08-10-2025

Q.1 Load a csv file using pandas and print it as a DataFrame?

In [27]:
df = pd.read_csv(r"C:\Users\HP\Downloads\german_credit_risk.csv")
data = pd.DataFrame(df)

Q.2 Load a excel file using pandas and print it as dataframe?

In [4]:
data = pd.read_excel(r"C:\Users\HP\Downloads\customers_dataset.xlsx")
df = pd.DataFrame(data)
data

,customer_id,customer_zip_code_prefix,customer_city,customer_state
0,06b8999e2fba1a1fbc88172c00ba8bc7,14409,franca,SP
1,18955e83d337fd6b2def6b18a428ac77,9790,sao bernardo do campo,SP
2,4e7b3e00288586ebd08712fdd0374a03,1151,sao paulo,SP
3,b2b6027bc5c5109e529d4dc6358b12c3,8775,mogi das cruzes,SP
4,4f2d8ab171c80ec8364f7c12e35b23ad,13056,campinas,SP
...,...,...,...,...
99436,17ddf5dd5d51696bb3d7c6291687be6f,3937,sao paulo,SP
99437,e7b71a9017aa05c9a7fd292d714858e8,6764,taboao da serra,SP
99438,5e28dfe12db7fb50a4b2f691faecea5e,60115,fortaleza,CE
99439,56b18e2166679b8a959d72dd06da27f9,92120,canoas,RS
99440,274fa6071e5e17fe303b9748641082c8,6703,cotia,SP

Q.3 Print the first 5 rows of the loaded data?

In [6]:
data.head()

,Unnamed: 0,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose,Risk
0,0,67,male,2,own,NaN,little,1169,6,radio/TV,good
1,1,22,female,2,own,little,moderate,5951,48,radio/TV,bad
2,2,49,male,1,own,little,NaN,2096,12,education,good
3,3,45,male,2,free,little,little,7882,42,furniture/equipment,good
4,4,53,male,2,free,little,little,4870,24,car,bad

Q.4 Print the dimensions of your dataset(i.e. the number of rows and columns of the dataset)

In [26]:
df.shape

(1000, 11)

Q.5 Output the column header names of loaded dataset?

In [33]:
df.columns

Index(['Unnamed: 0', 'Age', 'Sex', 'Job', 'Housing', 'Saving accounts',
       'Checking account', 'Credit amount', 'Duration', 'Purpose', 'Risk'],
      dtype='object')

Q.6 Print the detailed info of the loaded dataset?

In [31]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        1000 non-null   int64
 1   Age               1000 non-null   int64
 2   Sex               1000 non-null   object
 3   Job               1000 non-null   int64
 4   Housing           1000 non-null   object
 5   Saving accounts   817 non-null    object
 6   Checking account  606 non-null    object
 7   Credit amount     1000 non-null   int64
 8   Duration          1000 non-null   int64
 9   Purpose           1000 non-null   object
 10  Risk              1000 non-null   object
dtypes: int64(5), object(6)
memory usage: 86.1+ KB

Q.7 print detailed statiscal report on loaded dataset?

In [40]:
data.describe()

        Unnamed: 0          Age          Job  Credit amount     Duration
count  1000.000000  1000.000000  1000.000000    1000.000000  1000.000000
mean    499.500000    35.546000     1.904000    3271.258000    20.903000
std     288.819436    11.375469     0.653614    2822.736876    12.058814
min       0.000000    19.000000     0.000000     250.000000     4.000000
25%     249.750000    27.000000     2.000000    1365.500000    12.000000
50%     499.500000    33.000000     2.000000    2319.500000    18.000000
75%     749.250000    42.000000     2.000000    3972.250000    24.000000
max     999.000000    75.000000     3.000000   18424.000000    72.000000

Q.8 load a new dataframe and output the third row of the data frame?

In [47]:
data.iloc[2:3,:]

,Unnamed: 0,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose,Risk
2,2,49,male,1,own,little,NaN,2096,12,education,good

Q.9 Output the last row of the data frame!

In [49]:
data.tail(1)

,Unnamed: 0,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose,Risk
999,999,27,male,2,own,moderate,moderate,4576,45,car,good

Q.10 Output the last 3 columns of the data frame!

In [9]:
data.iloc[:,-3:]

     Duration              Purpose  Risk
0           6             radio/TV  good
1          48             radio/TV   bad
2          12            education  good
3          42  furniture/equipment  good
4          24                  car   bad
..        ...                  ...   ...
995        12  furniture/equipment  good
996        30                  car  good
997        12             radio/TV  good
998        45             radio/TV   bad
999        45                  car  good

[1000 rows x 3 columns]

In [8]:
data.loc[:,'Duration':'Risk']

     Duration              Purpose  Risk
0           6             radio/TV  good
1          48             radio/TV   bad
2          12            education  good
3          42  furniture/equipment  good
4          24                  car   bad
..        ...                  ...   ...
995        12  furniture/equipment  good
996        30                  car  good
997        12             radio/TV  good
998        45             radio/TV   bad
999        45                  car  good

[1000 rows x 3 columns]

In [ ]:
 # 11-10-25

In [33]:
data.head()

,Unnamed: 0,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose,Risk
0,0,67,male,2,own,NaN,little,1169,6,radio/TV,good
1,1,22,female,2,own,little,moderate,5951,48,radio/TV,bad
2,2,49,male,1,own,little,NaN,2096,12,education,good
3,3,45,male,2,free,little,little,7882,42,furniture/equipment,good
4,4,53,male,2,free,little,little,4870,24,car,bad

Q.11 obtain the frequency(no of time paticular element occur) of elements in column 3?

In [32]:
data.columns

Index(['Unnamed: 0', 'Age', 'Sex', 'Job', 'Housing', 'Saving accounts',
       'Checking account', 'Credit amount', 'Duration', 'Purpose', 'Risk'],
      dtype='object')

In [31]:
data['Job'].value_counts()

Job
2    630
1    200
3    148
0     22
Name: count, dtype: int64

Q.12 Make a Series from a list using pandas?

In [29]:
lst = [1,2,3,4,5,6,23,45,67,78]
x = pd.Series(lst)
x

0     1
1     2
2     3
3     4
4     5
5     6
6    23
7    45
8    67
9    78
dtype: int64

Q.13 Convert a pandas series to numpy array?

In [24]:
x.to_numpy()

array([ 1,  2,  3,  4,  5,  6, 23, 45, 67, 78])

Question 1: Creating a DataFrame from Dictionary

In [28]:
df = pd.DataFrame({'name':['a','b','c'],'age':[23,45,34]})
df

  name  age
0    a   23
1    b   45
2    c   34

In [ ]:
Question 2: Creating a DataFrame from List of Lists

In [44]:
df = pd.DataFrame([[1,2,3,4],[12,34,55,56],[2324,567,865,4556]],
                   index =[1,2,3],columns =['a','b','c','d'])
df

      a    b    c     d
1     1    2    3     4
2    12   34   55    56
3  2324  567  865  4556

In [ ]:
                                       # 12-11-2025  by vikas sir

In [2]:
import numpy as np
import pandas as pd

In [ ]:
# Series

In [7]:
ar = np.array([12,3,4,5,7,85])
ls = [1,2,3,4,54]
pd.Series(ar)   # series generated by array
pd.Series(ls)   # series generated by list

0     1
1     2
2     3
3     4
4    54
dtype: int64

In [8]:
t = (2,3,4,5,6,7)
pd.Series(t)

0    2
1    3
2    4
3    5
4    6
5    7
dtype: int64

In [17]:
dic = {'56,67}

name       [t, u, s]
age     [34, 56, 67]
dtype: object